In [85]:
# dummy list of dictionary to test the working code
reviews

[{'asin': 'B00F83SZQ',
  'helpful': [0, 0],
  'overall': 5.0,
  'reviewerID': 'A1F6404F1V',
  'reviewText': 'i enjoyed a lot'},
 {'asin': 'B00FUUSTT',
  'helpful': [2, 3],
  'overall': 3.0,
  'reviewerID': 'A1F6664TTHB',
  'reviewText': 'This book is unique'},
 {'asin': 'B00FUUSTT',
  'helpful': [2, 3],
  'overall': 3.0,
  'reviewerID': 'A1F6664TTHB',
  'reviewText': 'This book is unique'}]

In [86]:
def reviews_to_df(reviews):
    # import library required to create a Dataframe
    import pandas as pd
    
    #extract the required key and value pair to create a dataframe
    data = [dict((k, dictionary[k]) for k in ('reviewerID','asin','overall','reviewText','helpful'))  
            for dictionary in reviews]
    
    # create a Dataframe df
    df = pd.DataFrame(data)
    
    # add new column num_helpful and assign first field of helpful value.
    df['num_helpful'] = df.helpful.map(lambda x: x[0])
    
    # add new column num_evals and assign second field of helpful value.
    df['num_evals'] = df.helpful.map(lambda x: x[1])
    
    # delete helpful column as it is not required now.
    df.drop(columns=['helpful'],inplace=True)
    
    # rename the column name so as to meet the expectation of question 
    df.columns = ['reviewer','ebook','rating','text','num_helpful','num_evals']
    
    # change datatype of rating to integer
    df['rating'] = df['rating'].astype(int)
    
    # return the dataframe
    return df

In [87]:
reviews_to_df(reviews)

      reviewer      ebook  rating                 text  num_helpful  num_evals
0   A1F6404F1V  B00F83SZQ       5      i enjoyed a lot            0          0
1  A1F6664TTHB  B00FUUSTT       3  This book is unique            2          3
2  A1F6664TTHB  B00FUUSTT       3  This book is unique            2          3

In [88]:
reviews

[{'asin': 'B00F83SZQ',
  'helpful': [0, 0],
  'overall': 5.0,
  'reviewerID': 'A1F6404F1V',
  'reviewText': 'i enjoyed a lot'},
 {'asin': 'B00FUUSTT',
  'helpful': [2, 3],
  'overall': 3.0,
  'reviewerID': 'A1F6664TTHB',
  'reviewText': 'This book is unique'},
 {'asin': 'B00FUUSTT',
  'helpful': [2, 3],
  'overall': 3.0,
  'reviewerID': 'A1F6664TTHB',
  'reviewText': 'This book is unique'}]

In [175]:
reviews1 = [{'asin': 'B00F83SZQ',
  'helpful': [0, 0],
  'overall': 5.0,
  'reviewerID': 'A1F6404F1V',
  'reviewText': 'i enjoyed a lot'},
 {'asin': 'B0TT876T',
  'helpful': [2, 3],
  'overall': 5.0,
  'reviewerID': 'A1F1111TTHH',
  'reviewText': 'This book is unique'},
 {'asin': 'B084152',
  'helpful': [2, 3],
  'overall': 3.0,
  'reviewerID': 'A1F67474BBB',
  'reviewText': 'This book is unique'},
{'asin': 'B08TGR2',
'helpful': [2, 1],
'overall': 4.0,
'reviewerID': 'A1FTT64TTPPP',
'reviewText': 'This book is out of the box'}
           ]

In [167]:
reviews1

[{'asin': 'B00F83SZQ',
  'helpful': [0, 0],
  'overall': 5.0,
  'reviewerID': 'A1F6404F1V',
  'reviewText': 'i enjoyed a lot'},
 {'asin': 'B0TT876T',
  'helpful': [2, 3],
  'overall': 3.0,
  'reviewerID': 'A1F6664TTHB',
  'reviewText': 'This book is unique'},
 {'asin': 'B084152',
  'helpful': [2, 3],
  'overall': 3.0,
  'reviewerID': 'A1F6664TTHB',
  'reviewText': 'This book is unique'},
 {'asin': 'B08TGR2',
  'helpful': [2, 1],
  'overall': 5.0,
  'reviewerID': 'A1F&&64TTHB',
  'reviewText': 'This book is out of the box'}]

In [160]:
reviews2 = [{'asin': 'B00F83SZQ',
  'category': ['kindle store', 'kindle ebooks', 'Business & Money']},
 {'asin': 'B0TT876T',
  'category': ['kindle store',
   'kindle ebooks',
   'engineering & transportation']},
 {'asin': 'B084152',
  'category': ['kindle store', 'kindle ebooks', 'science fiction']},
 {'asin': 'B08HTGT',
  'category': ['kindle store', 'kindle ebooks', 'Business &amp; Money']}]

In [161]:
d={}
d['asin'] ='B08HTGT'
d['category'] = ['kindle store','kindle ebooks','Business &amp; Money']

In [117]:
reviews.append(d)

In [118]:
d

{'asin': 'B08HTGT',
 'category': ['kindle store', 'kindle ebooks', 'Business &amp; Money']}

In [142]:
# dummy metadata to test the code
metadata =

[{'asin': 'B0TTKKKK',
  'category': ['kindle store', 'kindle ebooks', 'Business & Money']},
 {'asin': 'B0TT876T',
  'category': ['kindle store',
   'kindle ebooks',
   'engineering & transportation']},
 {'asin': 'B084152',
  'category': ['kindle store', 'kindle ebooks', 'science fiction']},
 {'asin': 'B08HTGT',
  'category': ['kindle store', 'kindle ebooks', 'Business &amp; Money']}]

In [144]:
def metadata_to_df(metadata):
    # import library required to create a Dataframe
    import pandas as pd
    
    #extract the required key and value pair to create a dataframe
    data = [dict((k, dictionary[k]) for k in ('asin','category'))  
            for dictionary in metadata]
    
    # create a Dataframe df
    df = pd.DataFrame(data)
    
    # add new column genre and assign third field of category value.
    df['genre'] = df.category.map(lambda x: x[2])
    
    # replace '&amp;' with &
    df['genre'] = df['genre'].str.replace('&amp;','&')
    
    # delete category column as it is not required now.
    df.drop(columns=['category'],inplace=True)
    
    # rename the column name so as to meet the expectation of question 
    df.columns = ['ebook','genre']
    
    # return the dataframe
    return df

In [145]:
metadata_to_df(metadata) # call the function

      ebook                         genre
0  B0TTKKKK              Business & Money
1  B0TT876T  engineering & transportation
2   B084152               science fiction
3   B08HTGT              Business & Money

In [151]:
metadata

[{'asin': 'B0TTKKKK',
  'category': ['kindle store', 'kindle ebooks', 'Business & Money']}]

In [152]:
metadata_to_df(metadata)

      ebook             genre
0  B0TTKKKK  Business & Money

In [ ]:
import pandas as pd

#extract the required key and value pair to create a dataframe
data = [dict((k, dictionary[k]) for k in ('asin','category'))  
        for dictionary in metadata]

# create a Dataframe df
df = pd.DataFrame(data)

# add new column num_helpful and assign first field of helpful value.
df['num_helpful'] = df.helpful.map(lambda x: x[0])

# add new column num_evals and assign second field of helpful value.
df['num_evals'] = df.helpful.map(lambda x: x[1])

# delete helpful column as it is not required now.
df.drop(columns=['helpful'],inplace=True)

# rename the column name so as to meet the expectation of question 
df.columns = ['reviewer','ebook','rating','text','num_helpful','num_evals']

# change datatype of rating to integer
df['rating'] = df['rating'].astype(int)

In [139]:
df = pd.DataFrame(data)

In [140]:
df = pd.DataFrame(data)
df['genre'] = df.category.map(lambda x: x[2])
df['genre'] = df['genre'].str.replace('&amp;','&')
df.drop(columns=['category'],inplace=True)
df.columns = ['ebook','genre']

In [141]:
df

      ebook                         genre
0  B0TTKKKK              Business & Money
1  B0TT876T  engineering & transportation
2   B084152               science fiction
3   B08HTGT              Business & Money

In [134]:
df

       asin  category                         genre
0  B0TTKKKK       NaN              Business & Money
1  B0TT876T       NaN  engineering & transportation
2   B084152       NaN               science fiction
3   B08HTGT       NaN              Business & Money

In [176]:
reviews_df = reviews_to_df(reviews1)
metadata_df = metadata_to_df(reviews2)

In [185]:
reviews_df

,reviewer,ebook,rating,text,num_helpful,num_evals
0,A1F6404F1V,B00F83SZQ,5,i enjoyed a lot,0,0
1,A1F1111TTHH,B0TT876T,5,This book is unique,2,3
2,A1F67474BBB,B084152,3,This book is unique,2,3
3,A1FTT64TTPPP,B08TGR2,4,This book is out of the box,2,1

In [186]:
metadata_df

       ebook                         genre
0  B00F83SZQ              Business & Money
1   B0TT876T  engineering & transportation
2    B084152               science fiction
3    B08HTGT              Business & Money

In [187]:
def combine_dfs(reviews_df,metadata_df):
    # import library
    import pandas as pd
    
    # merge reviews_df and metadata_df dataframe based on ebook column
    # it will create a new dataframe containg ebooks available in both
    merged_df = pd.merge(reviews_df,metadata_df, how='inner', on=['ebook'])
    # return merged dataframe
    return merged_df

In [188]:
combine_dfs(reviews_df,metadata_df)

,reviewer,ebook,rating,text,num_helpful,num_evals,genre
0,A1F6404F1V,B00F83SZQ,5,i enjoyed a lot,0,0,Business & Money
1,A1F1111TTHH,B0TT876T,5,This book is unique,2,3,engineering & transportation
2,A1F67474BBB,B084152,3,This book is unique,2,3,science fiction